veroxzik/bemani-arduino-boards/Additional Files/arduino-bemani/avr/boards.txt
##############################################################

micro.name=Bemani Controller (Micro/Pro Micro)

micro.vid.0=0x2341
micro.pid.0=0x0037
micro.vid.1=0x2341
micro.pid.1=0x8037
micro.vid.2=0x2A03
micro.pid.2=0x0037
micro.vid.3=0x2A03
micro.pid.3=0x8037

micro.vid.4=0x2341
micro.pid.4=0x0237
# If the board is a 2341:0237 use 2341:8237 for build and set
# other parameters as well
micro.vid.4.build.vid=0x2341
micro.vid.4.build.pid=0x8237
micro.vid.4.build.usb_product="Genuino Micro"
micro.vid.4.bootloader.file=caterina/Caterina-Genuino-Micro.hex

micro.vid.5=0x2341
micro.pid.5=0x8237
# If the board is a 2341:8237 use 2341:8237 for build and set
# other paramters as well
micro.vid.5.build.vid=0x2341
micro.vid.5.build.pid=0x8237
micro.vid.5.build.usb_product="Genuino Micro"
micro.vid.5.bootloader.file=caterina/Caterina-Genuino-Micro.hex

micro.upload.tool=avrdude
micro.upload.protocol=avr109
micro.upload.maximum_size=28672
micro.upload.maximum_data_size=2560
micro.upload.speed=57600
micro.upload.disable_flushing=true
micro.upload.use_1200bps_touch=true
micro.upload.wait_for_upload_port=true

micro.bootloader.tool=avrdude
micro.bootloader.low_fuses=0xff
micro.bootloader.high_fuses=0xd8
micro.bootloader.extended_fuses=0xcb
micro.bootloader.file=caterina/Caterina-Micro.hex
micro.bootloader.unlock_bits=0x3F
micro.bootloader.lock_bits=0x2F

micro.build.mcu=atmega32u4
micro.build.f_cpu=16000000L
micro.build.vid=0x2341
micro.build.pid=0x8037
micro.build.usb_product="Bemani Controller"
micro.build.board=AVR_MICRO
micro.build.core=arduino
micro.build.variant=micro
micro.build.extra_flags={build.usb_flags}

##############################################################

microiidx.name=IIDX Premium (Micro/Pro Micro)

microiidx.vid.0=0x1ccf
microiidx.pid.0=0x8048

microiidx.upload.tool=avrdude
microiidx.upload.protocol=avr109
microiidx.upload.maximum_size=28672
microiidx.upload.maximum_data_size=2560
microiidx.upload.speed=57600
microiidx.upload.disable_flushing=true
microiidx.upload.use_1200bps_touch=true
microiidx.upload.wait_for_upload_port=true

microiidx.bootloader.tool=avrdude
microiidx.bootloader.low_fuses=0xff
microiidx.bootloader.high_fuses=0xd8
microiidx.bootloader.extended_fuses=0xcb
microiidx.bootloader.file=caterina/Caterina-Micro.hex
microiidx.bootloader.unlock_bits=0x3F
microiidx.bootloader.lock_bits=0x2F

microiidx.build.mcu=atmega32u4
microiidx.build.f_cpu=16000000L
microiidx.build.vid=0x1ccf
microiidx.build.pid=0x8048
microiidx.build.usb_product="beatmania IIDX controller premium model"
microiidx.build.board=AVR_MICRO
microiidx.build.core=arduino
microiidx.build.variant=micro
microiidx.build.extra_flags={build.usb_flags}
microiidx.build.usb_manufacturer="Konami Amusement"

##############################################################

microsdvx.name=SDVX NEMSYS (Micro/Pro Micro)

microsdvx.vid.0=0x1ccf
microsdvx.pid.0=0x101c

microsdvx.upload.tool=avrdude
microsdvx.upload.protocol=avr109
microsdvx.upload.maximum_size=28672
microsdvx.upload.maximum_data_size=2560
microsdvx.upload.speed=57600
microsdvx.upload.disable_flushing=true
microsdvx.upload.use_1200bps_touch=true
microsdvx.upload.wait_for_upload_port=true

microsdvx.bootloader.tool=avrdude
microsdvx.bootloader.low_fuses=0xff
microsdvx.bootloader.high_fuses=0xd8
microsdvx.bootloader.extended_fuses=0xcb
microsdvx.bootloader.file=caterina/Caterina-Micro.hex
microsdvx.bootloader.unlock_bits=0x3F
microsdvx.bootloader.lock_bits=0x2F

microsdvx.build.mcu=atmega32u4
microsdvx.build.f_cpu=16000000L
microsdvx.build.vid=0x1ccf
microsdvx.build.pid=0x101c
microsdvx.build.usb_product="SOUND VOLTEX controller"
microsdvx.build.board=AVR_MICRO
microsdvx.build.core=arduino
microsdvx.build.variant=micro
microsdvx.build.extra_flags={build.usb_flags}
microsdvx.build.usb_manufacturer="Konami Amusement"